<a href="https://colab.research.google.com/github/ludimilla23/Exercicios_python/blob/main/ExercicioBDSQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sqlite3

# Conectar ao banco de dados (ou criar um novo)
con = sqlite3.connect('alunos.db')

# Criar um cursor para interagir com o banco de dados
cursor = con.cursor()

# Criar a tabela alunos se ela não existir
cursor.execute('''
CREATE TABLE IF NOT EXISTS alunos (
    id INT PRIMARY KEY,
    nome VARCHAR(100),
    idade INT,
    curso VARCHAR(100)
)
''')

# Salvar as mudanças
con.commit()

# Executar a consulta para selecionar todos os dados da tabela alunos
cursor.execute("SELECT * FROM alunos;")
tabela = cursor.fetchall()

# Exibir os resultados
for linha in tabela:
    print(linha)

exercicio 2

In [ ]:

cursor.execute("INSERT INTO alunos (id, nome, idade, curso) VALUES (1, 'João', 20, 'Engenharia');")
cursor.execute("INSERT INTO alunos (id, nome, idade, curso) VALUES (2, 'Maria', 22, 'Medicina');")
cursor.execute("INSERT INTO alunos (id, nome, idade, curso) VALUES (3, 'Pedro', 19, 'Direito');")
cursor.execute("INSERT INTO alunos (id, nome, idade, curso) VALUES (4, 'Ana', 21, 'Ciências');")
cursor.execute("INSERT INTO alunos (id, nome, idade, curso) VALUES (5, 'Lucas', 23, 'Administração');")
cursor.execute("INSERT INTO alunos (id, nome, idade, curso) VALUES (6, 'Julia', 20, 'Engenharia');")

con.commit()

exercicio 3

In [ ]:
#questão a)
cursor.execute("SELECT * FROM alunos;")
tabela = cursor.fetchall()
for linha in tabela:
    print(linha)

(1, 'João', 20, 'Engenharia')
(2, 'Maria', 22, 'Medicina')
(3, 'Pedro', 19, 'Direito')
(4, 'Ana', 21, 'Ciências')
(5, 'Lucas', 23, 'Administração')
(6, 'Julia', 20, 'Engenharia')

In [ ]:
#questão b)
cursor.execute("SELECT nome, idade FROM alunos WHERE idade > 20;")
tabela = cursor.fetchall()
for linha in tabela:
    print(linha)

('Maria', 22)
('Ana', 21)
('Lucas', 23)

In [ ]:
#Questão c)
cursor.execute("SELECT * FROM alunos WHERE curso = 'Engenharia' ORDER BY nome")
tabela = cursor.fetchall()
for linha in tabela:
    print(linha)

(1, 'João', 20, 'Engenharia')
(6, 'Julia', 20, 'Engenharia')

In [ ]:
#Questão d)
cursor.execute("SELECT COUNT(*) FROM alunos;")
tabela = cursor.fetchall()
for linha in tabela:
    print(linha)

(6,)

exercicio 4

In [ ]:
#Questão a)
cursor.execute("UPDATE alunos SET idade = 21 WHERE nome = 'Maria';")
con.commit()

In [ ]:
#Questão b)
cursor.execute("DELETE FROM alunos WHERE id = 4;")
con.commit()

In [ ]:
cursor.execute("SELECT * FROM alunos;")
tabela = cursor.fetchall()
for linha in tabela:
    print(linha)

(1, 'João', 20, 'Engenharia')
(2, 'Maria', 21, 'Medicina')
(3, 'Pedro', 19, 'Direito')
(5, 'Lucas', 23, 'Administração')
(6, 'Julia', 20, 'Engenharia')

exercicio 5

In [ ]:
cursor.execute("CREATE TABLE IF NOT EXISTS clientes(id INT PRIMARY KEY, nome VARCHAR(100), idade INT, saldo FLOAT)")
con.commit()

In [ ]:
cursor.execute("INSERT INTO clientes (id, nome, idade, saldo) VALUES (1, 'João', 20, 100.0);")
cursor.execute("INSERT INTO clientes (id, nome, idade, saldo) VALUES (2, 'Maria', 22, 500.0);")
cursor.execute("INSERT INTO clientes (id, nome, idade, saldo) VALUES (3, 'Pedro', 19, 200.25);")
cursor.execute("INSERT INTO clientes (id, nome, idade, saldo) VALUES (4, 'Ana', 21, 800.0);")
cursor.execute("INSERT INTO clientes (id, nome, idade, saldo) VALUES (5, 'Lucas', 23, 300.0);")
cursor.execute("INSERT INTO clientes (id, nome, idade, saldo) VALUES (6, 'Julia', 20, 1200.50);")
con.commit()

In [ ]:
cursor.execute("UPDATE clientes set idade = 31 WHERE nome = 'Maria';")
con.commit()

exercicio 6

In [ ]:
#Questão a)
cursor.execute("SELECT nome, idade FROM clientes WHERE idade > 30;")
tabela = cursor.fetchall()
for linha in tabela:
    print(linha)

('Maria', 31)

In [ ]:
#Questão b)
cursor.execute("SELECT AVG(saldo) AS saldo_medio FROM clientes;")
saldo_medio = cursor.fetchone()[0]
print(f"O saldo médio dos clientes é: {saldo_medio}")

O saldo médio dos clientes é: 516.7916666666666

In [ ]:
#Questão c)
cursor.execute("SELECT MAX(saldo), nome AS saldo_max FROM clientes;")
tabela = cursor.fetchall()
for linha in tabela:
    print(linha)

(1200.5, 'Julia')

In [ ]:
#Questão d)
cursor.execute("SELECT COUNT(*) FROM clientes WHERE saldo > 1000;")
tabela = cursor.fetchall()
for linha in tabela:
    print(linha)

(1,)

exercicio 7

In [ ]:
#Questão a)
cursor.execute("UPDATE clientes set saldo = 950 WHERE id = 4;")
con.commit()
#Questão b)
cursor.execute("DELETE FROM clientes WHERE id = 2;")
con.commit()

cursor.execute("SELECT * FROM clientes;")
tabela = cursor.fetchall()
for linha in tabela:
    print(linha)

(1, 'João', 20, 100.0)
(3, 'Pedro', 19, 200.25)
(4, 'Ana', 21, 950.0)
(5, 'Lucas', 23, 300.0)
(6, 'Julia', 20, 1200.5)

exercicio 8

In [ ]:
cursor.execute("CREATE TABLE IF NOT EXISTS compras(id INT PRIMARY KEY, cliente_id INT, produto VARCHAR(100), valor FLOAT, FOREIGN KEY (cliente_id) REFERENCES clientes(id))")
cursor.execute("INSERT INTO compras (id, cliente_id, produto, valor) VALUES (1, 1, 'Camiseta', 25.0);")
cursor.execute("INSERT INTO compras (id, cliente_id, produto, valor) VALUES (5, 5, 'Calça', 50.0);")
cursor.execute("INSERT INTO compras (id, cliente_id, produto, valor) VALUES (3, 3, 'Tênis', 100.0);")
cursor.execute("INSERT INTO compras (id, cliente_id, produto, valor) VALUES (4, 4, 'Sapato', 75.0);")
con.commit()

In [ ]:
cursor.execute('''SELECT clientes.nome, compras.produto, compras.valor
FROM compras
JOIN clientes ON compras.cliente_id = clientes.id
''')
tabela = cursor.fetchall()
for linha in tabela:
    print(linha)

('João', 'Camiseta', 25.0)
('Lucas', 'Calça', 50.0)
('Pedro', 'Tênis', 100.0)
('Ana', 'Sapato', 75.0)

In [ ]:
con.close()